Biplane_Fully_Resolved/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          62242;
        startFace       99343;
    }
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          62242;
        startFace       161585;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          96;
        startFace       223827;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          96;
        startFace       223923;
    }
    upperairfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          217;
        startFace       224019;
    }
    lowerairfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          217;
        startFace       224236;
    }
)

// ************************************************************************* //
