Biplane_Fully_Resolved/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    upperairfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
217
(
0.427995
0.52014
0.51017
0.510142
0.520139
0.42001
0.300031
0.300064
...
)
;
    }
    lowerairfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
217
(
0.427995
0.52014
0.51017
0.510142
0.520139
0.42001
0.300031
0.300064
...
)
;
    }
}


// ************************************************************************* //
